capillaryWave/64x64RDF/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          64;
        startFace       8064;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rightWall;
    }
    rightWall
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          64;
        startFace       8128;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  leftWall;
    }
    lowerWall
    {
        type            patch;
        nFaces          64;
        startFace       8192;
    }
    atmosphere
    {
        type            patch;
        nFaces          64;
        startFace       8256;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8192;
        startFace       8320;
    }
)

// ************************************************************************* //
